---
kind: type
id: T:Autodesk.Revit.DB.Electrical.CorrectionFactor
source: html/203305c0-061a-5607-9f94-5d0cb9a2ca06.htm
---
# Autodesk.Revit.DB.Electrical.CorrectionFactor

Represents electrical correction factor information.

## Syntax (C#)
```csharp
public class CorrectionFactor : APIObject
```

## Remarks
Correction factor is defined based on corresponding wire material type and temperature rating type.